12. Concatenate & Merge DataFrames (Joins)

In [2]:
import pandas as pd

df1 = pd.DataFrame({
    "EmpID": [1, 2, 3],
    "Name": ["Aman", "Riya", "Kunal"]
})

df2 = pd.DataFrame({
    "EmpID": [4, 5],
    "Name": ["Sneha", "Vikram"]
})

In [3]:
# CONCATENATE (pd.concat)

result = pd.concat([df1,df2])
print(result)

   EmpID    Name
0      1    Aman
1      2    Riya
2      3   Kunal
0      4   Sneha
1      5  Vikram

In [5]:
# for Clean index 
print(pd.concat([df1,df2],ignore_index=True))

   EmpID    Name
0      1    Aman
1      2    Riya
2      3   Kunal
3      4   Sneha
4      5  Vikram

In [6]:
# Concatenate COLUMN-wise
df3 = pd.DataFrame({
    "Salary": [50000,40000,35000]
})
result2 = pd.concat([df1,df3],axis=1)
print(result2)

   EmpID   Name  Salary
0      1   Aman   50000
1      2   Riya   40000
2      3  Kunal   35000

In [8]:
# When columns mismatch
df4 = pd.DataFrame({
    "EmpID": [6],
    "Name": ["Pooja"],
    "Department": ["IT"]
})

pd.concat([df1,df4],ignore_index=True)

   EmpID   Name Department
0      1   Aman        NaN
1      2   Riya        NaN
2      3  Kunal        NaN
3      6  Pooja         IT

In [9]:
# MERGE (JOINS)
employees = pd.DataFrame({
    "EmpID": [1, 2, 3, 4],
    "Name": ["Aman", "Riya", "Kunal", "Sneha"]
})

salary = pd.DataFrame({
    "EmpID": [1, 2, 4, 5],
    "Salary": [50000, 48000, 70000, 60000]
})

In [ ]:
# pd.merge(left_df, right_df, on="CommonColumn", how="type"). syntax

In [ ]:
# NNER JOIN (default)
pd.merge(employees, salary, on="EmpID", how="inner")

   EmpID   Name  Salary
0      1   Aman   50000
1      2   Riya   48000
2      4  Sneha   70000

In [12]:
# LEFT JOIN
pd.merge(employees,salary,on="EmpID",how= "left")

   EmpID   Name   Salary
0      1   Aman  50000.0
1      2   Riya  48000.0
2      3  Kunal      NaN
3      4  Sneha  70000.0

In [13]:
# RIGHT JOIN
pd.merge(employees,salary,on="EmpID",how="right")

   EmpID   Name  Salary
0      1   Aman   50000
1      2   Riya   48000
2      4  Sneha   70000
3      5    NaN   60000

In [14]:
# OUTER JOIN
pd.merge(employees,salary,on="EmpID",how="outer")

   EmpID   Name   Salary
0      1   Aman  50000.0
1      2   Riya  48000.0
2      3  Kunal      NaN
3      4  Sneha  70000.0
4      5    NaN  60000.0

In [15]:
# Merge on DIFFERENT column names
dfA = pd.DataFrame({
    "ID": [1, 2, 3],
    "Name": ["A", "B", "C"]
})

dfB = pd.DataFrame({
    "EmpID": [1, 3],
    "Salary": [50000, 60000]
})

pd.merge(dfA,dfB,left_on="ID",right_on="EmpID")

   ID Name  EmpID  Salary
0   1    A      1   50000
1   3    C      3   60000

In [19]:
# Concatenate two DataFrames row-wise
pd.concat([df1,df2])

   EmpID    Name
0      1    Aman
1      2    Riya
2      3   Kunal
0      4   Sneha
1      5  Vikram